Results/mongodb/load-target-50-2.dat
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.MongoDbClient -P /root/ycsb/config/mongodb.conf -P /root/ycsb/config/workload-ycsb-thomas -P /root/ycsb/config/workload-ycsb-thomas-load -s -load
 0 sec: 0 operations; 
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.47:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.46:27017/ycsb
MongoDB type: Read: primary, Write: safe
new database url = 172.16.32.48:27017/ycsb
MongoDB type: Read: primary, Write: safe
 10 sec: 20797 operations; 2073.07 current ops/sec; [INSERT AverageLatency(us)=46853.5] 
 20 sec: 39480 operations; 1866.25 current ops/sec; [INSERT AverageLatency(us)=65115.67] 
 30 sec: 57726 operations; 1824.42 current ops/sec; [INSERT AverageLatency(us)=6840.33] 
 40 sec: 75738 operations; 1800.66 current ops/sec; [INSERT AverageLatency(us)=12439] 
 50 sec: 95246 operations; 1950.21 current ops/sec;  
 60 sec: 109616 operations; 1436.86 current ops/sec; [INSERT AverageLatency(us)=36489.2] 
 70 sec: 125812 operations; 1619.11 current ops/sec; [INSERT AverageLatency(us)=8281] 
 80 sec: 143141 operations; 1732.38 current ops/sec;  
 90 sec: 160779 operations; 1763.62 current ops/sec;  
 100 sec: 176520 operations; 1573.79 current ops/sec;  
 110 sec: 192002 operations; 1548.05 current ops/sec;  
 120 sec: 210496 operations; 1849.03 current ops/sec; [INSERT AverageLatency(us)=11705.5] 
 130 sec: 226555 operations; 1605.1 current ops/sec;  
 140 sec: 242541 operations; 1598.28 current ops/sec; [INSERT AverageLatency(us)=9580.67] 
 150 sec: 260054 operations; 1750.77 current ops/sec; [INSERT AverageLatency(us)=10153.56] 
 160 sec: 279584 operations; 1952.41 current ops/sec;   
 170 sec: 293128 operations; 1354.26 current ops/sec; [INSERT AverageLatency(us)=7059.62]  
 175 sec: 300000 operations; 1221.04 current ops/sec;   
[OVERALL], RunTime(ms), 175706.0
[OVERALL], Throughput(ops/sec), 1707.3975846015503
[INSERT], Operations, 300000
[INSERT], AverageLatency(us), 16913.902863333333
[INSERT], MinLatency(us), 781
[INSERT], MaxLatency(us), 1875275
[INSERT], Return=0, 300000
[INSERT], 0, 34068.038223140495
[INSERT], 1000, 14404.635718186782
[INSERT], 2000, 11084.714285714286
[INSERT], 3000, 20345.79643591501
[INSERT], 4000, 12299.508954602248
[INSERT], 5000, 9331.802421924793
[INSERT], 6000, 8743.89766341319
[INSERT], 7000, 12070.643654402646
[INSERT], 8000, 23429.82528735632
[INSERT], 9000, 12801.012581344903
[INSERT], 10000, 18304.447290053602
[INSERT], 11000, 12204.201060358891
[INSERT], 12000, 12003.690017513134
[INSERT], 13000, 15983.191489361701
[INSERT], 14000, 14129.907987866532
[INSERT], 15000, 34386.46
[INSERT], 16000, 14743.443590974555
[INSERT], 17000, 17733.801484230054
[INSERT], 18000, 22112.094312455003
[INSERT], 19000, 12383.246961805555
[INSERT], 20000, 12830.52489048188
[INSERT], 21000, 20238.308997050146
[INSERT], 22000, 16212.97381671702
[INSERT], 23000, 16301.083153347732
[INSERT], 24000, 15571.190170940172
[INSERT], 25000, 15877.264053635894
[INSERT], 26000, 12670.919036144578
[INSERT], 27000, 22496.02380952381
[INSERT], 28000, 19512.26594301221
[INSERT], 29000, 21067.808569454042
[INSERT], 30000, 16189.662330905307
[INSERT], 31000, 13800.998611753817
[INSERT], 32000, 23690.892234548337
[INSERT], 33000, 21079.11773255814
[INSERT], 34000, 16818.34972067039
[INSERT], 35000, 14421.646096306686
[INSERT], 36000, 18051.12334536703
[INSERT], 37000, 15638.759583789704
[INSERT], 38000, 15742.512924480487
[INSERT], 39000, 14099.801780693533
[INSERT], 40000, 12082.578883000408
[INSERT], 41000, 18158.793206197854
[INSERT], 42000, 16039.044623655915
[INSERT], 43000, 16076.01902173913
[INSERT], 44000, 21304.262789067976
[INSERT], 45000, 14763.334669338677
[INSERT], 46000, 12219.485143692158
[INSERT], 47000, 17899.957273652086
[INSERT], 48000, 14048.5297982168
[INSERT], 49000, 20721.56377730796
[INSERT], 50000, 13637.46688206785
[INSERT], 52000, 120685.50649350649
[INSERT], 53000, 19092.088860270444
[INSERT], 54000, 20067.493642483172
[INSERT], 55000, 15010.160780669145
[INSERT], 56000, 17476.108011869437
[INSERT], 57000, 18753.485221674877
[INSERT], 58000, 14935.185167464115
[INSERT], 59000, 13335.06270320483
[INSERT], 60000, 16234.805089334055
[INSERT], 61000, 20365.466981132075
[INSERT], 62000, 16474.93200215866
[INSERT], 63000, 17684.683965014578
[INSERT], 64000, 22405.84039334342
[INSERT], 65000, 24223.34870550162
[INSERT], 66000, 13201.478395061727
[INSERT], 67000, 17091.87910798122
[INSERT], 68000, 42029.511596180084
[INSERT], 69000, 14644.262798634812
[INSERT], 70000, 18302.36302623551
[INSERT], 71000, 14333.919447092469
[INSERT], 72000, 13217.244165170556
[INSERT], 73000, 13861.55427473583
[INSERT], 74000, 16618.012156448203
[INSERT], 75000, 13051.190476190477
[INSERT], 76000, 18219.01110425663
[INSERT], 77000, 20992.777008310248
[INSERT], 78000, 39467.63216783217
[INSERT], 79000, 34656.232279171214
[INSERT], 80000, 12964.940718303764
[INSERT], 81000, 13425.433182047404
[INSERT], 82000, 25256.546724890828
[INSERT], 83000, 17190.189378757514
[INSERT], 84000, 26202.174157303372
[INSERT], 85000, 18738.74450386215
[INSERT], 86000, 13893.170288024256
[INSERT], 87000, 16010.482456140351
[INSERT], 88000, 17009.290357529793
[INSERT], 89000, 15946.152631578947
[INSERT], 90000, 16164.646179401994
[INSERT], 91000, 19192.078320802004
[INSERT], 92000, 13225.332292595896
[INSERT], 93000, 12932.141381185427
[INSERT], 94000, 26419.58371735791
[INSERT], 95000, 51080.777272727275
[INSERT], 96000, 30557.295108259823
[INSERT], 97000, 16750.244166192373
[INSERT], 98000, 16053.82047402925
[INSERT], 99000, 20670.059515062454
[INSERT], 100000, 30134.293673276676
[INSERT], 101000, 21488.09444844989
[INSERT], 102000, 16117.987647690656
[INSERT], 103000, 22021.46806912096
[INSERT], 104000, 14263.512171372931
[INSERT], 105000, 23007.092369477912
[INSERT], 106000, 26704.598984771572
[INSERT], 107000, 14289.545750116116
[INSERT], 108000, 23112.005555555555
[INSERT], 109000, 13164.388799138394
[INSERT], 110000, 18025.26624015748
[INSERT], 111000, 14925.985012919897
[INSERT], 112000, 34788.71709006929
[INSERT], 113000, 13783.519265232975
[INSERT], 114000, 12957.957182320442
[INSERT], 115000, 21804.053351573188
[INSERT], 116000, 14942.067036290322
[INSERT], 117000, 13148.983482142858
[INSERT], 118000, 16255.742328042328
[INSERT], 119000, 14424.247949831162
[INSERT], 120000, 13573.35827664399
[INSERT], 121000, 13613.930625285258
[INSERT], 122000, 14666.297945205479
[INSERT], 123000, 13754.141007859454
[INSERT], 124000, 17006.020327498587
[INSERT], 125000, 17892.36228435455
[INSERT], 126000, 19259.770750988144
[INSERT], 127000, 28221.952475247526
[INSERT], 128000, 61074.019305019305
[INSERT], 129000, 41915.900140646976
[INSERT], 130000, 21670.133285816108
[INSERT], 131000, 18356.336842105262
[INSERT], 132000, 18458.491484184913
[INSERT], 133000, 14708.026328862394
[INSERT], 134000, 14798.857420924574
[INSERT], 135000, 18129.8656626506
[INSERT], 136000, 14002.284629981024
[INSERT], 137000, 19307.79694462126
[INSERT], 138000, 29374.58620689655
[INSERT], 139000, 53018.88693098385
[INSERT], 140000, 13463.629562043796
[INSERT], 141000, 34392.9874715262
[INSERT], 142000, 13587.365393465256
[INSERT], 143000, 24441.824193548386
[INSERT], 144000, 13287.168097605061
[INSERT], 145000, 19214.852130325813
[INSERT], 146000, 15463.870815899581
[INSERT], 147000, 16008.172048703018
[INSERT], 148000, 14520.292951541851
[INSERT], 149000, 16975.05918367347
[INSERT], 150000, 13114.319457013575
[INSERT], 151000, 14243.961187214612
[INSERT], 152000, 20803.98794326241
[INSERT], 153000, 14781.702252693438
[INSERT], 154000, 14422.656325739215
[INSERT], 155000, 15955.673480083857
[INSERT], 156000, 17229.706221198157
[INSERT], 157000, 13525.731684554363
[INSERT], 158000, 12015.399907749077
[INSERT], 159000, 14497.121511627907
[INSERT], 160000, 13387.629081632653
[INSERT], 161000, 13392.12507936508
[INSERT], 162000, 28392.678188319427
[INSERT], 163000, 22121.77049180328
[INSERT], 164000, 14564.47844463229
[INSERT], 165000, 36659.11846689895
[INSERT], 166000, 21272.787458745875
[INSERT], 167000, 8802.794184461609
[INSERT], 168000, 15787.696162881753
[INSERT], 169000, 12450.10471524801
[INSERT], 170000, 40113.17871485944
[INSERT], 171000, 18386.266540642722
[INSERT], 172000, 11341.34847579199
[INSERT], 173000, 8955.37466014138
[INSERT], 174000, 7168.897229669347
[INSERT], 175000, 3911.3793103448274
[CLEANUP], Operations, 30
[CLEANUP], AverageLatency(us), 2419.4333333333334
[CLEANUP], MinLatency(us), 1077
[CLEANUP], MaxLatency(us), 7046
[CLEANUP], 0, 4610.0
[CLEANUP], 1000, 2579.5
[CLEANUP], 3000, 3228.0
[CLEANUP], 4000, 1839.5
[CLEANUP], 5000, 2207.0
[CLEANUP], 6000, 3566.0
[CLEANUP], 14000, 1078.0
[CLEANUP], 16000, 2530.1428571428573
[CLEANUP], 17000, 2039.6666666666667
[CLEANUP], 18000, 1716.6666666666667
java -cp /root/ycsb/YCSB/mongodb/target/mongodb-binding-0.1.4.jar:/root/ycsb/YCSB/mongodb/target/archive-tmp/mongodb-binding-0.1.4.jar:/root/ycsb/YCSB/hbase/src/main/conf:/root/ycsb/YCSB/nosqldb/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf/postgresql-9.3-1100.jdbc41.jar:/root/ycsb/YCSB/infinispan/src/main/conf:/root/ycsb/YCSB/dynamodb/conf:/root/ycsb/YCSB/core/target/core-0.1.4.jar:/root/ycsb/YCSB/gemfire/src/main/conf:/root/ycsb/YCSB/voldemort/src/main/conf com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -P /root/ycsb/config/mongodb.conf -P /root/ycsb/config/workload-ycsb-thomas -P /root/ycsb/config/workload-ycsb-thomas-load -s -load